Revit 2027 API
AdvancedWood.WoodRayEllipseRadiusX Property
 The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodRayEllipseRadiusX { get; }
Public Shared ReadOnly Property WoodRayEllipseRadiusX As String
	Get
public:
static property String^ WoodRayEllipseRadiusX {
	String^ get ();
}
static member WoodRayEllipseRadiusX : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace